{"class_name": "Model", "keras_version": "1.2.2", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 56, 56, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}}, {"name": "block1_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 64, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block1_conv1", "activity_regularizer": null, "nb_row": 3}}, {"name": "block1_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 64, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block1_conv2", "activity_regularizer": null, "nb_row": 3}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "block1_pool"}}, {"name": "block2_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 128, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block2_conv1", "activity_regularizer": null, "nb_row": 3}}, {"name": "block2_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 128, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block2_conv2", "activity_regularizer": null, "nb_row": 3}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "block2_pool"}}, {"name": "block3_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 256, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block3_conv1", "activity_regularizer": null, "nb_row": 3}}, {"name": "block3_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 256, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block3_conv2", "activity_regularizer": null, "nb_row": 3}}, {"name": "block3_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 256, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block3_conv3", "activity_regularizer": null, "nb_row": 3}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "block3_pool"}}, {"name": "block4_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block4_conv1", "activity_regularizer": null, "nb_row": 3}}, {"name": "block4_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block4_conv2", "activity_regularizer": null, "nb_row": 3}}, {"name": "block4_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block4_conv3", "activity_regularizer": null, "nb_row": 3}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "block4_pool"}}, {"name": "block5_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block5_conv1", "activity_regularizer": null, "nb_row": 3}}, {"name": "block5_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block5_conv2", "activity_regularizer": null, "nb_row": 3}}, {"name": "block5_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "activation": "relu", "nb_filter": 512, "dim_ordering": "tf", "bias": true, "nb_col": 3, "trainable": true, "name": "block5_conv3", "activity_regularizer": null, "nb_row": 3}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "block5_pool"}}, {"name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "tf"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "config": {"init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "relu", "input_dim": 512, "bias": true, "b_constraint": null, "output_dim": 1024, "trainable": true, "activity_regularizer": null, "name": "dense_1"}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "activation": "softmax", "input_dim": 1024, "bias": true, "b_constraint": null, "output_dim": 4, "trainable": true, "activity_regularizer": null, "name": "dense_2"}}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}